Revit 2024 API
AreaCreationData Constructor
Overload List
Name | Description
AreaCreationData(Object)
Initializes a new instance of the AreaCreationData class
AreaCreationData(ViewPlan, UV)
The data needed to create a new area
See Also
AreaCreationData Class
AreaCreationData Members
Autodesk.Revit.Creation Namespace